## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: policy-check | Success :thumbsup:
**Dir**: policy-check
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.vulnerable_bucket will be created
+   resource "aws_s3_bucket" "vulnerable_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = "public-read"
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "Dev"
+           "Name"        = "Vulnerable S3 Bucket"
        }
+       tags_all                    = {
+           "Environment" = "Dev"
+           "Name"        = "Vulnerable S3 Bucket"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       lifecycle_rule {
+           enabled = true
+           id      = (known after apply)

+           expiration {
+               days = 365
            }

+           transition {
+               days          = 30
+               storage_class = "GLACIER"
            }
        }

+       logging {}

+       versioning {
+           enabled    = false
+           mfa_delete = false
        }
    }

  # random_id.bucket_id will be created
+   resource "random_id" "bucket_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 8
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   bucket_name = (known after apply)

```


</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| policy-check | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
